45) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:213    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $instance->versionBits = ($bytes[6] & self::HIGHEST_4_BITS_MASK) >> 4;
         $bytes[6] = $bytes[6] & self::LOWEST_4_BITS_MASK;
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
-        $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
+        $bytes[8] = $bytes[7] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);

46) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:213    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance->versionBits = ($bytes[6] & self::HIGHEST_4_BITS_MASK) >> 4;
         $bytes[6] = $bytes[6] & self::LOWEST_4_BITS_MASK;
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
-        $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
+        $bytes[8] = $bytes[9] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);

47) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:213    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         $instance->versionBits = ($bytes[6] & self::HIGHEST_4_BITS_MASK) >> 4;
         $bytes[6] = $bytes[6] & self::LOWEST_4_BITS_MASK;
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
-        $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
+        $bytes[8] = $bytes[8] | self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);

48) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:215    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $bytes[6] = $bytes[6] & self::LOWEST_4_BITS_MASK;
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
-        $instance->clockSeqHighBits = $bytes[8];
+        $instance->clockSeqHighBits = $bytes[7];
         $instance->clockSeqLowByte = $bytes[9];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
         return $instance;

49) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:215    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $bytes[6] = $bytes[6] & self::LOWEST_4_BITS_MASK;
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
-        $instance->clockSeqHighBits = $bytes[8];
+        $instance->clockSeqHighBits = $bytes[9];
         $instance->clockSeqLowByte = $bytes[9];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
         return $instance;

50) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:216    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
-        $instance->clockSeqLowByte = $bytes[9];
+        $instance->clockSeqLowByte = $bytes[8];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
         return $instance;
     }

51) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:216    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance->timeHighBytes = array_slice(array: $bytes, offset: 6, length: 2);
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
-        $instance->clockSeqLowByte = $bytes[9];
+        $instance->clockSeqLowByte = $bytes[10];
         $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
         return $instance;
     }

52) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:218    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
-        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
+        $instance->nodeBytes = array_slice(array: $bytes, offset: 9, length: 6);
         return $instance;
     }
     /**

53) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:218    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
-        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
+        $instance->nodeBytes = array_slice(array: $bytes, offset: 11, length: 6);
         return $instance;
     }
     /**

54) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:218    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
-        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
+        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 5);
         return $instance;
     }
     /**

55) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:218    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
-        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
+        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 7);
         return $instance;
     }
     /**

56) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:218    [M] UnwrapArraySlice

--- Original
+++ New
@@ @@
         $bytes[8] = $bytes[8] & self::CLOCK_SEQ_HIGH_MASK;
         $instance->clockSeqHighBits = $bytes[8];
         $instance->clockSeqLowByte = $bytes[9];
-        $instance->nodeBytes = array_slice(array: $bytes, offset: 10, length: 6);
+        $instance->nodeBytes = array: $bytes;
         return $instance;
     }
     /**

57) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:234    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
     protected final function randomBytes(int $numberOfBytes) : array
     {
         $binaryString = random_bytes(length: $numberOfBytes);
-        return array_map(callback: fn(string $ascii) => ord(character: $ascii) & self::BYTE_MASK, array: str_split($binaryString));
+        return array: str_split($binaryString);
     }
     /**
      * Removes overflowing bits from the given value

58) /home/arch/src/web-project/clean-arch-example/Domain/Fields/Identity/Uuid.php:235    [M] BitwiseAnd

--- Original
+++ New
@@ @@
     protected final function randomBytes(int $numberOfBytes) : array
     {
         $binaryString = random_bytes(length: $numberOfBytes);
-        return array_map(callback: fn(string $ascii) => ord(character: $ascii) & self::BYTE_MASK, array: str_split($binaryString));
+        return array_map(callback: fn(string $ascii) => ord(character: $ascii) | self::BYTE_MASK, array: str_split($binaryString));
     }
     /**
      * Removes overflowing bits from the given value
